package bot

// Buttons
const (
	SEND_PHONE_BUTTON = "Отправить номер телефона"
)

// Start messages
const (
	START_MESSAGE                       = "Добро пожаловать! \n\nСпасибо, что выбрали наш сервис."
	REQUEST_CONTACT_PHONE_MESSAGE_FIRST = "Для начала работы с нами, пожалуйста, предоставьте Ваш номер телефона."
	REQUEST_CONTACT_PHONE_MESSAGE       = "Для работы с нами, пожалуйста, предоставьте Ваш номер телефона."
	PHONE_SUCCED_SAVED                  = "Ваш номер телефона успешно сохранён."
	ADD_ACCOUNT_MESSAGE_ERROR           = "Возникла ошибка при сохранении номера телефона"
)

// Error messages
const (
	UNEXPECTED_MESSAGE = "Здравствуйте!\n\nЕсли по каким-то причинам бот не срабатывает обратитесь в поддержку. \n\n Если нужна помощь, мы на связи  hello@example.ru 📩"
	MESSAGE_UNKNOWN    = "Неизвестная команда."
)
